# DataFrame and Series

In [24]:
import pandas as pd

## Pandas DataFrame

In [29]:
#讀取csv檔案，以第0欄位作為row的參考
AAPL = pd.read_csv("data/aapldata.csv", index_col=0)

In [30]:
AAPL.head()

             open    high       low   close    volume
date
2018/3/20  175.24  176.80  174.9400  175.24  19620520
2018/3/19  177.32  177.47  173.6600  175.30  32931110
2018/3/16  178.65  179.12  177.6200  178.02  38313330
2018/3/15  178.50  180.24  178.0701  178.65  22676520
2018/3/14  180.32  180.52  177.8100  178.44  29334630

In [31]:
type(AAPL) #AAPL是一種「資料框」形式

pandas.core.frame.DataFrame

In [32]:
AAPL.shape #AAPL dimension

(377, 5)

## index and columns

In [33]:
AAPL.columns #欄的參考指標

Index(['open', 'high', 'low', 'close', 'volume'], dtype='object')

In [34]:
type(AAPL.columns)

pandas.core.indexes.base.Index

In [35]:
AAPL.index #列的參考指標

Index(['2018/3/20', '2018/3/19', '2018/3/16', '2018/3/15', '2018/3/14',
       '2018/3/13', '2018/3/12', '2018/3/9', '2018/3/8', '2018/3/7',
       ...
       '2016/10/3', '2016/9/30', '2016/9/29', '2016/9/28', '2016/9/27',
       '2016/9/26', '2016/9/23', '2016/9/22', '2016/9/21', '2016/9/20'],
      dtype='object', name='date', length=377)

In [36]:
type(AAPL.index)

pandas.core.indexes.base.Index

In [37]:
print(AAPL)

               open     high       low   close    volume
date
2018/3/20   175.240  176.800  174.9400  175.24  19620520
2018/3/19   177.320  177.470  173.6600  175.30  32931110
2018/3/16   178.650  179.120  177.6200  178.02  38313330
2018/3/15   178.500  180.240  178.0701  178.65  22676520
2018/3/14   180.320  180.520  177.8100  178.44  29334630
2018/3/13   182.590  183.500  179.2400  179.97  31464170
2018/3/12   180.290  182.390  180.2100  181.72  32191070
2018/3/9    177.960  180.000  177.3900  179.98  32130360
2018/3/8    175.480  177.120  175.0700  176.94  24518850
2018/3/7    174.940  175.850  174.2700  175.03  31686450
2018/3/6    177.910  178.250  176.1300  176.67  23273160
2018/3/5    175.210  177.740  174.5200  176.82  27825140
2018/3/2    172.800  176.300  172.4500  176.21  38426060
2018/3/1    178.540  179.775  172.6600  175.00  48706170
2018/2/28   179.260  180.615  178.0500  178.12  37568080
2018/2/27   179.100  180.480  178.1600  178.39  38885510
2018/2/26   176.350  179.390  176.2100  178.97  37353670
2018/2/23   173.670  175.650  173.5400  175.50  33772050
2018/2/22   171.800  173.950  171.7100  172.50  30953760
2018/2/21   172.830  174.120  171.0100  171.07  37378070
2018/2/20   172.050  174.260  171.4200  171.85  33690660
2018/2/16   172.360  174.820  171.7700  172.43  40113790
2018/2/15   169.790  173.090  169.0000  172.99  50908540
2018/2/14   163.045  167.540  162.8800  167.37  40382890
2018/2/13   161.950  164.750  161.6500  164.34  32483310
2018/2/12   158.500  163.890  157.5100  162.71  60774900
2018/2/9    157.070  157.890  150.2400  156.41  70583530
2018/2/8    160.290  161.000  155.0300  155.15  54145930
2018/2/7    163.085  163.400  159.0685  159.54  51467440
2018/2/6    154.830  163.720  154.0000  163.03  68171940
...             ...      ...       ...     ...       ...
2016/10/31  113.650  114.230  113.2000  113.54  26378910
2016/10/28  113.870  115.210  113.4500  113.72  36792100
2016/10/27  115.390  115.860  114.1000  114.48  31396130
2016/10/26  114.310  115.700  113.3100  115.59  66028640
2016/10/25  117.950  118.360  117.3100  118.25  46820600
2016/10/24  117.100  117.740  117.0000  117.65  23492650
2016/10/21  116.810  116.910  116.2800  116.60  22527690
2016/10/20  116.860  117.380  116.3300  117.06  24100150
2016/10/19  117.250  117.760  113.8000  117.12  19977160
2016/10/18  118.180  118.210  117.4500  117.47  24308210
2016/10/17  117.330  117.840  116.7800  117.55  23583810
2016/10/14  117.880  118.170  117.1300  117.63  35626020
2016/10/13  116.790  117.440  115.7200  116.98  35041820
2016/10/12  117.350  117.980  116.7500  117.34  37512930
2016/10/11  117.700  118.690  116.2000  116.30  63963010
2016/10/10  115.020  116.750  114.7200  116.05  36087910
2016/10/7   114.310  114.560  113.5100  114.06  24336440
2016/10/6   113.700  114.340  113.1300  113.89  28508710
2016/10/5   113.400  113.660  112.6900  113.05  21400410
2016/10/4   113.060  114.310  112.6300  113.00  29707270
2016/10/3   112.710  113.050  112.2800  112.52  21634520
2016/9/30   112.460  113.370  111.8000  113.05  36340670
2016/9/29   113.160  113.800  111.8000  112.18  35850010
2016/9/28   113.690  114.640  113.4300  113.95  29608390
2016/9/27   113.000  113.180  112.3400  113.09  24587490
2016/9/26   111.640  113.390  111.5500  112.88  29800240
2016/9/23   114.420  114.790  111.5500  112.71  52411070
2016/9/22   114.350  114.940  114.0000  114.62  31048170
2016/9/21   113.850  113.989  112.4410  113.55  35951900
2016/9/20   113.050  114.120  112.5100  113.57  34494150

[377 rows x 5 columns]

## slicing (分割資料)

### iloc()

In [38]:
AAPL.iloc[:5, :]

             open    high       low   close    volume
date
2018/3/20  175.24  176.80  174.9400  175.24  19620520
2018/3/19  177.32  177.47  173.6600  175.30  32931110
2018/3/16  178.65  179.12  177.6200  178.02  38313330
2018/3/15  178.50  180.24  178.0701  178.65  22676520
2018/3/14  180.32  180.52  177.8100  178.44  29334630

In [39]:
AAPL.iloc[-5:, :]

             open     high      low   close    volume
date
2016/9/26  111.64  113.390  111.550  112.88  29800240
2016/9/23  114.42  114.790  111.550  112.71  52411070
2016/9/22  114.35  114.940  114.000  114.62  31048170
2016/9/21  113.85  113.989  112.441  113.55  35951900
2016/9/20  113.05  114.120  112.510  113.57  34494150

## head()

In [40]:
AAPL.head()

             open    high       low   close    volume
date
2018/3/20  175.24  176.80  174.9400  175.24  19620520
2018/3/19  177.32  177.47  173.6600  175.30  32931110
2018/3/16  178.65  179.12  177.6200  178.02  38313330
2018/3/15  178.50  180.24  178.0701  178.65  22676520
2018/3/14  180.32  180.52  177.8100  178.44  29334630

In [41]:
AAPL.head(2)

             open    high     low   close    volume
date
2018/3/20  175.24  176.80  174.94  175.24  19620520
2018/3/19  177.32  177.47  173.66  175.30  32931110

## tail()

In [42]:
AAPL.tail()

             open     high      low   close    volume
date
2016/9/26  111.64  113.390  111.550  112.88  29800240
2016/9/23  114.42  114.790  111.550  112.71  52411070
2016/9/22  114.35  114.940  114.000  114.62  31048170
2016/9/21  113.85  113.989  112.441  113.55  35951900
2016/9/20  113.05  114.120  112.510  113.57  34494150

In [43]:
AAPL.tail(3)

             open     high      low   close    volume
date
2016/9/22  114.35  114.940  114.000  114.62  31048170
2016/9/21  113.85  113.989  112.441  113.55  35951900
2016/9/20  113.05  114.120  112.510  113.57  34494150

## info()

In [44]:
AAPL.info()

<class 'pandas.core.frame.DataFrame'>
Index: 377 entries, 2018/3/20 to 2016/9/20
Data columns (total 5 columns):
open      377 non-null float64
high      377 non-null float64
low       377 non-null float64
close     377 non-null float64
volume    377 non-null int64
dtypes: float64(4), int64(1)
memory usage: 17.7+ KB

## broadcasting

In [49]:
import numpy as np
AAPL.iloc[::3, 2]=np.nan
AAPL.head(10)

             open    high     low   close      volume
date
2018/3/20  175.24  176.80     NaN  175.24         NaN
2018/3/19  177.32  177.47  173.66  175.30  32931110.0
2018/3/16  178.65  179.12  177.62  178.02  38313330.0
2018/3/15  178.50  180.24     NaN  178.65         NaN
2018/3/14  180.32  180.52  177.81  178.44  29334630.0
2018/3/13  182.59  183.50  179.24  179.97  31464170.0
2018/3/12  180.29  182.39     NaN  181.72         NaN
2018/3/9   177.96  180.00  177.39  179.98  32130360.0
2018/3/8   175.48  177.12  175.07  176.94  24518850.0
2018/3/7   174.94  175.85     NaN  175.03         NaN

In [50]:
AAPL.info()

<class 'pandas.core.frame.DataFrame'>
Index: 377 entries, 2018/3/20 to 2016/9/20
Data columns (total 5 columns):
open      377 non-null float64
high      377 non-null float64
low       251 non-null float64
close     377 non-null float64
volume    251 non-null float64
dtypes: float64(5)
memory usage: 17.7+ KB

In [51]:
low = AAPL["low"]

In [52]:
type(low)

pandas.core.series.Series

In [55]:
low.head()

date
2018/3/20       NaN
2018/3/19    173.66
2018/3/16    177.62
2018/3/15       NaN
2018/3/14    177.81
Name: low, dtype: float64

## series

In [56]:
lows = low.values

In [57]:
type(lows)

numpy.ndarray